; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p15---int100n150-m25---int100c200---s425---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level5 level5)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level5 level6)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level5 level7)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level5 level8)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level5 level9)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level5 level10)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level5 level11)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level5 level12)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level5 level13)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level5 level14)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level5 level15)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level5 level16)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level5 level17)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level5 level18)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level5 level19)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level5 level20)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level5 level21)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level5 level22)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level5 level23)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level5 level24)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level5 level25)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level5 level26)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level5 level27)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level5 level28)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level5 level29)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level5 level30)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level5 level31)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level5 level32)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level5 level33)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level5 level34)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level5 level35)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level5 level36)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level5 level37)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level5 level38)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level5 level39)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level5 level40)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level5 level41)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level5 level42)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level5 level43)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level5 level44)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level5 level45)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level5 level46)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level5 level47)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level5 level48)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level5 level49)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level5 level50)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level5 level51)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level5 level52)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level5 level53)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level5 level54)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level5 level55)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level5 level56)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level5 level57)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level5 level58)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level5 level59)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level5 level60)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level5 level61)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level5 level62)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level5 level63)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level5 level64)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level5 level65)
(sum level60 level16 level76)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level5 level66)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level5 level67)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level5 level68)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level5 level69)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level5 level70)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level5 level71)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level5 level72)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level5 level73)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level5 level74)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level5 level75)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level5 level76)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level75 level1 level76)

(connected l0 l1)
(fuelcost level17 l0 l1)
(connected l0 l2)
(fuelcost level5 l0 l2)
(connected l0 l3)
(fuelcost level2 l0 l3)
(connected l1 l0)
(fuelcost level17 l1 l0)
(connected l1 l2)
(fuelcost level16 l1 l2)
(connected l1 l3)
(fuelcost level25 l1 l3)
(connected l2 l0)
(fuelcost level5 l2 l0)
(connected l2 l1)
(fuelcost level16 l2 l1)
(connected l2 l3)
(fuelcost level1 l2 l3)
(connected l3 l0)
(fuelcost level2 l3 l0)
(connected l3 l1)
(fuelcost level25 l3 l1)
(connected l3 l2)
(fuelcost level1 l3 l2)

(at t0 l1)
(fuel t0 level76)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l0)
(at p6 l1)
(at p7 l1)
(at p8 l2)
(at p9 l1)
(at p10 l0)
(at p11 l3)
(at p12 l0)
(at p13 l0)
(at p14 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l2)
(at p6 l2)
(at p7 l2)
(at p8 l3)
(at p9 l0)
(at p10 l3)
(at p11 l2)
(at p12 l1)
(at p13 l1)
(at p14 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 15
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 15
3. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 15
4. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 15
5. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 15
6. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 15
7. (drive t0 l1 l2 level60 level16 level76)
   deleted: (at t0 l1) (fuel t0 level76)
   added: (at t0 l2) (fuel t0 level60)
   goals met: 0 of 15
8. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 1 of 15
9. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 2 of 15
10. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 15
11. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 3 of 15
12. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 3 of 15
13. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 3 of 15
14. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 3 of 15
15. (drive t0 l2 l0 level55 level5 level60)
   deleted: (at t0 l2) (fuel t0 level60)
   added: (at t0 l0) (fuel t0 level55)
   goals met: 3 of 15
16. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 4 of 15
17. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 5 of 15
18. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 6 of 15
19. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 7 of 15
20. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 7 of 15
21. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 7 of 15
22. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 7 of 15
23. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 7 of 15
24. (drive t0 l0 l1 level38 level17 level55)
   deleted: (at t0 l0) (fuel t0 level55)
   added: (at t0 l1) (fuel t0 level38)
   goals met: 7 of 15
25. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 8 of 15
26. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 9 of 15
27. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 10 of 15
28. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 11 of 15
29. (drive t0 l1 l3 level13 level25 level38)
   deleted: (at t0 l1) (fuel t0 level38)
   added: (at t0 l3) (fuel t0 level13)
   goals met: 11 of 15
30. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 11 of 15
31. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 12 of 15
32. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 13 of 15
33. (drive t0 l3 l2 level12 level1 level13)
   deleted: (at t0 l3) (fuel t0 level13)
   added: (at t0 l2) (fuel t0 level12)
   goals met: 13 of 15
34. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 14 of 15
35. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 15 of 15
